In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [10]:
ser= pd.Series()
ser

Series([], dtype: float64)

In [11]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [12]:
ser= pd.Series([20,15.7,'10'])

ser

0      20
1    15.7
2      10
dtype: object

In [4]:
#Create Dictionary 
dict= {'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}

In [5]:
df=pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [16]:
#add new column and add values into it
df['States']= "CA NV AZ".split()

In [17]:
df

   A  B  C States
0  1  5  1     CA
1  2  8  2     NV
2  5  9  3     AZ

In [18]:
# how to create Nan values and its manipulation
dict= {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [8]:
df=pd.DataFrame(dict)

In [9]:
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [6]:
#Adding a new column D
df['D']= [20,30,40]
df

   A  B  C   D
0  1  5  1  20
1  2  8  2  30
2  5  9  3  40

In [7]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [12]:
dict= {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,4]}
df=pd.DataFrame(dict)

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  4

In [14]:
print(df.dropna(axis=1)) # Dropping any column with NA value.

   C
0  1
1  2
2  4

In [15]:
df['D']= [20,30,40]
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  4  40

In [16]:
print(df.dropna(axis=1))

   C   D
0  1  20
1  2  30
2  4  40

In [17]:
# droppoing any rows with NAN values
print(df.dropna(axis=0))

     A    B  C   D
0  1.0  5.0  1  20

In [18]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  4  40

In [19]:
# Filling values with default values 
print(df.fillna(value=50))

      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  30
2  50.0  50.0  4  40

In [20]:
#data frame remains the same, We will see we can save the dataframe later
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  4  40

In [21]:
#Filling values with computed values (mean of column C)
df.fillna(value=df['C'].mean(),inplace=True)  # inplace= True will save the changed dataframe.
print(df)

          A         B  C   D
0  1.000000  5.000000  1  20
1  2.000000  2.333333  2  30
2  2.333333  2.333333  4  40

In [22]:
#create data frame
data= {'Company':['Goog','Goog','Msft','Msft','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,350,124,243,359]}
df= pd.DataFrame(data)
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    Msft      Amy    350
3    Msft  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    359

In [23]:
# Grouping by company column and listing mean values.
byComp=df.groupby('Company')
print(byComp.mean())

         Sales
Company
FB       301.0
Goog     160.0
Msft     237.0

In [24]:
# Grouping by company column and listing sum values
print(byComp.sum())

         Sales
Company
FB         602
Goog       320
Msft       474

In [2]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [ ]:
Class_a= pd.DataFrame({'Math':[45,68,35,]})